particle-iot/device-os/hal/src/nRF52840/ble_hal_legacy.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "ble_hal_legacy.h"

#include "nrf_ble_gatt.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble.h"

#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "logging.h"

LOG_SOURCE_CATEGORY("hal.ble_legacy")

//#define BLE_HAL_LEGACY

#ifdef BLE_HAL_LEGACY
namespace {

// Advertising interval in 0.625 ms units
const auto FAST_ADVERT_INTERVAL = MSEC_TO_UNITS(40, UNIT_0_625_MS); // Fast mode
const auto SLOW_ADVERT_INTERVAL = MSEC_TO_UNITS(500, UNIT_0_625_MS); // Slow mode

// Advertising duration in 10 ms units (fast mode)
const auto FAST_ADVERT_TIMEOUT = MSEC_TO_UNITS(180000, UNIT_10_MS); // Fast mode
const auto SLOW_ADVERT_TIMEOUT = 0; // Advertise indefinitely (slow mode)

// Minimum acceptable connection interval in 1.25 ms units
const auto MIN_CONN_INTERVAL = MSEC_TO_UNITS(30, UNIT_1_25_MS);

// Maximum acceptable connection interval in 1.25 ms units
const auto MAX_CONN_INTERVAL = MSEC_TO_UNITS(45, UNIT_1_25_MS);

// Connection supervisory timeout in 10 ms units
const auto CONN_SUP_TIMEOUT = MSEC_TO_UNITS(5000, UNIT_10_MS);

// Slave latency (a number of LL connection events)
const auto SLAVE_LATENCY = 0;

// Maximum number of attempts to agree on the connection interval
const auto MAX_CONN_PARAM_UPDATE_ATTEMPTS = 2;

// Application's BLE observer priority
const auto BLE_OBSERVER_PRIO = 3;

// An application-specific tag identifying the SoftDevice BLE configuration (can't be 0)
const auto CONN_CFG_TAG = 1;

// Default MTU size
const auto DEFAULT_MTU = 23;

// Default data length size
const auto DEFAULT_DATA_LENGTH = 27;

// Advertising module instance
BLE_ADVERTISING_DEF(g_advert);

// GATT module instance
NRF_BLE_GATT_DEF(g_gatt);

struct Char {
    ble_uuid_t uuid;
    ble_gatts_char_handles_t handles;
    uint16_t flags;
};

struct Service {
    ble_uuid_t uuid;
    uint16_t handle;
    Char chars[BLE_MAX_CHAR_COUNT];
    uint16_t charCount;
};

struct Profile {
    Service services[BLE_MAX_SERVICE_COUNT];
    uint16_t serviceCount;
    uint16_t flags;
    ble_event_callback callback;
    void* userData;
};

struct Conn {
    uint16_t handle;
    uint16_t paramUpdateAttempts;
};

// Current profile
Profile g_profile = {};

// Connection state
volatile Conn g_conn = {
    .handle = BLE_CONN_HANDLE_INVALID,
    .paramUpdateAttempts = 0
};

// Advertising mode flag
volatile bool g_advertEnabled = false;

static_assert(NRF_SDH_BLE_PERIPHERAL_LINK_COUNT == 1, "Multiple simultaneous peripheral connections are not supported");

int halError(uint32_t error) {
    switch (error) {
    case NRF_ERROR_INVALID_STATE:
        return BLE_ERROR_INVALID_STATE;
    case NRF_ERROR_BUSY:
        return BLE_ERROR_BUSY;
    case NRF_ERROR_NO_MEM:
        return BLE_ERROR_NO_MEMORY;
    default:
        return BLE_ERROR_UNKNOWN;
    }
}

int updateConnInterval(uint16_t connHandle, uint16_t interval) {
    ble_gap_conn_params_t param = {};
    param.min_conn_interval = interval;
    param.max_conn_interval = interval;
    param.slave_latency = SLAVE_LATENCY;
    param.conn_sup_timeout = CONN_SUP_TIMEOUT;
    LOG_DEBUG(TRACE, "Requesting connection interval: %u x 1.25 ms", (unsigned)interval);
    const auto ret = sd_ble_gap_conn_param_update(connHandle, &param);
    if (ret != NRF_SUCCESS) {
        LOG_DEBUG(WARN, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    return 0;
}

const Char* findChar(uint16_t handle) {
    for (size_t i = 0; i < g_profile.serviceCount; ++i) {
        const Service& svc = g_profile.services[i];
        for (size_t j = 0; j < svc.charCount; ++j) {
            const Char& chr = svc.chars[j];
            if (chr.handles.value_handle == handle || chr.handles.cccd_handle == handle) {
                return &chr;
            }
        }
    }
    return nullptr;
}

void processBleEvent(const ble_evt_t* event, void* data) {
    switch (event->header.evt_id) {
    case BLE_GAP_EVT_CONNECTED: {
        LOG_DEBUG(TRACE, "Connected");
        g_conn.handle = event->evt.gap_evt.conn_handle;
        g_conn.paramUpdateAttempts = 0;
        const auto& connParam = event->evt.gap_evt.params.connected.conn_params;
        if (connParam.max_conn_interval > MIN_CONN_INTERVAL && MAX_CONN_PARAM_UPDATE_ATTEMPTS != 0) {
            updateConnInterval(g_conn.handle, MIN_CONN_INTERVAL);
            ++g_conn.paramUpdateAttempts;
        }
        ble_connected_event_data d = {};
        d.conn_handle = g_conn.handle;
        g_profile.callback(BLE_EVENT_CONNECTED, &d, g_profile.userData);
        break;
    }
    case BLE_GAP_EVT_DISCONNECTED: {
        LOG_DEBUG(TRACE, "Disconnected");
        g_conn.handle = BLE_CONN_HANDLE_INVALID;
        ble_disconnected_event_data d = {};
        d.conn_handle = event->evt.gap_evt.conn_handle;
        g_profile.callback(BLE_EVENT_DISCONNECTED, &d, g_profile.userData);
        break;
    }
    case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
        const auto& connParam = event->evt.gap_evt.params.conn_param_update.conn_params;
        LOG_DEBUG(TRACE, "Connection interval updated: %u x 1.25 ms", (unsigned)connParam.max_conn_interval);
        if (connParam.max_conn_interval > MIN_CONN_INTERVAL && g_conn.paramUpdateAttempts < MAX_CONN_PARAM_UPDATE_ATTEMPTS) {
            updateConnInterval(g_conn.handle, MIN_CONN_INTERVAL);
            ++g_conn.paramUpdateAttempts;
        }
        break;
    }
    case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
        const auto conn = event->evt.gap_evt.conn_handle;
        uint32_t ret = 0;
        if (g_profile.flags & BLE_PROFILE_FLAG_ENABLE_PAIRING) {
            // const ble_gap_sec_params_t& peerParam = event->evt.gap_evt.params.sec_params_request.peer_params;
            // Local security parameters
            ble_gap_sec_params_t param = {};
            param.bond = 0; // No bonding
            param.mitm = 0; // No MITM protection
            param.lesc = 0; // TODO: LE Secure Connections
            param.oob = 0; // No out of band data
            param.io_caps = BLE_GAP_IO_CAPS_NONE; // No IO capabilities
            param.min_key_size = 7;
            param.max_key_size = 16;
            // Security key set
            ble_gap_sec_keyset_t keyset = {};
            ret = sd_ble_gap_sec_params_reply(conn, BLE_GAP_SEC_STATUS_SUCCESS, &param, &keyset);
        } else {
            // Pairing is not supported
            ret = sd_ble_gap_sec_params_reply(conn, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
        }
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
        }
        break;
    }
    case BLE_GAP_EVT_AUTH_STATUS: {
        const auto status = event->evt.gap_evt.params.auth_status.auth_status;
        if (status == BLE_GAP_SEC_STATUS_SUCCESS) {
            LOG_DEBUG(TRACE, "Authentication succeeded");
        } else {
            LOG(WARN, "Authentication failed, status: %d", (int)status);
        }
        break;
    }
    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
        LOG_DEBUG(TRACE, "PHY update request");
        ble_gap_phys_t phys = {};
        phys.rx_phys = BLE_GAP_PHY_AUTO;
        phys.tx_phys = BLE_GAP_PHY_AUTO;
        const uint32_t ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
        }
        break;
    }
    case BLE_GATTS_EVT_WRITE: {
        const ble_gatts_evt_write_t& writeParam = event->evt.gatts_evt.params.write;
        const auto chr = findChar(writeParam.handle);
        if (chr) {
            if (writeParam.handle == chr->handles.value_handle) {
                ble_data_received_event_data d = {};
                d.conn_handle = event->evt.gatts_evt.conn_handle;
                d.char_handle = chr->handles.value_handle;
                d.data = (const char*)writeParam.data;
                d.size = writeParam.len;
                g_profile.callback(BLE_EVENT_DATA_RECEIVED, &d, g_profile.userData);
            } else if (writeParam.handle == chr->handles.cccd_handle && writeParam.len == 2) {
                LOG_DEBUG(TRACE, "CCCD changed");
                ble_char_param_changed_event_data d = {};
                d.conn_handle = event->evt.gatts_evt.conn_handle;
                d.char_handle = chr->handles.value_handle;
                g_profile.callback(BLE_EVENT_CHAR_PARAM_CHANGED, &d, g_profile.userData);
            }
        }
        break;
    }
    case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
        ble_data_sent_event_data d = {};
        d.conn_handle = event->evt.gatts_evt.conn_handle;
        g_profile.callback(BLE_EVENT_DATA_SENT, &d, g_profile.userData);
        break;
    }
    case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
        // No persistent system attributes
        const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
        }
        break;
    }
    case BLE_GATTS_EVT_TIMEOUT: {
        // Disconnect on GATT server timeout
        const uint32_t ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        }
        break;
    }
    case BLE_GATTC_EVT_TIMEOUT: {
        // Disconnect on GATT client timeout
        const uint32_t ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        }
        break;
    }
    default:
        // LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        break;
    }
}

