particle-iot/device-os/hal/src/nRF52840/ble_hal_legacy.cpp
void processAdvertEvent(ble_adv_evt_t event) {
    switch (event) {
    case BLE_ADV_EVT_FAST:
        // TODO: Automatic restarting of the advertising mode can be disabled by setting
        // `ble_adv_on_disconnect_disabled` to `true` during initialization of the advertising module
        if (!g_advertEnabled) {
            const uint32_t ret = sd_ble_gap_adv_stop(g_advert.adv_handle);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
            }
        } else {
            LOG_DEBUG(TRACE, "Fast advertising mode started");
            g_profile.callback(BLE_EVENT_ADVERT_STARTED, nullptr, g_profile.userData);
        }
        break;
    case BLE_ADV_EVT_SLOW:
        LOG_DEBUG(TRACE, "Slow advertising mode started");
        break;
    case BLE_ADV_EVT_IDLE:
        LOG_DEBUG(TRACE, "Advertising stopped");
        g_profile.callback(BLE_EVENT_ADVERT_STOPPED, nullptr, g_profile.userData);
        break;
    default:
        // LOG_DEBUG(TRACE, "Unhandled advertising event: %u", (unsigned)event);
        break;
    }
}

void processGattEvent(nrf_ble_gatt_t* gatt, const nrf_ble_gatt_evt_t* event) {
    if (event->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED) {
        LOG_DEBUG(TRACE, "MTU updated: %u", (unsigned)event->params.att_mtu_effective);
        ble_conn_param_changed_event_data d = {};
        d.conn_handle = event->conn_handle;
        g_profile.callback(BLE_EVENT_CONN_PARAM_CHANGED, &d, g_profile.userData);
    } else {
        // LOG_DEBUG(TRACE, "Unhandled GATT event: %u", (unsigned)event->evt_id);
    }
}

int initAdvert(const ble_manuf_data* halManufData) {
    // Service UUIDs
    ble_uuid_t svcUuids[BLE_MAX_SERVICE_COUNT] = {};
    for (size_t i = 0; i < g_profile.serviceCount; ++i) {
        svcUuids[i] = g_profile.services[i].uuid;
    }
    // Initialize the advertising module
    ble_advertising_init_t init = {};
    ble_advdata_manuf_data_t manufData = {};
    if (halManufData) {
        manufData.company_identifier = halManufData->company_id;
        manufData.data.p_data = (uint8_t*)halManufData->data;
        manufData.data.size = halManufData->size;
        init.advdata.p_manuf_specific_data = &manufData;
    }
    init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.srdata.uuids_complete.uuid_cnt = g_profile.serviceCount;
    init.srdata.uuids_complete.p_uuids = svcUuids;
    init.config.ble_adv_fast_enabled = true;
    init.config.ble_adv_fast_interval = FAST_ADVERT_INTERVAL;
    init.config.ble_adv_fast_timeout = FAST_ADVERT_TIMEOUT;
    init.config.ble_adv_slow_enabled = true;
    init.config.ble_adv_slow_interval = SLOW_ADVERT_INTERVAL;
    init.config.ble_adv_slow_timeout = SLOW_ADVERT_TIMEOUT;
    init.evt_handler = processAdvertEvent;
    const uint32_t ret = ble_advertising_init(&g_advert, &init);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "ble_advertising_init() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    ble_advertising_conn_cfg_tag_set(&g_advert, CONN_CFG_TAG);
    return 0;
}

void setSecurityMode(ble_gap_conn_sec_mode_t* secMode, uint16_t charFlags) {
    if (charFlags & BLE_CHAR_FLAG_REQUIRE_PAIRING) {
        BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(secMode); // Require encryption, but not MITM protection
    } else {
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(secMode); // No protection
    }
}

int initTxChar(uint16_t serviceHandle, ble_char* halChar, Char* chr) {
    // Characteristic UUID
    chr->uuid.type = halChar->uuid.type;
    chr->uuid.uuid = halChar->uuid.uuid;
    // CCCD metadata (Client Characteristic Configuration Descriptor)
    ble_gatts_attr_md_t cccdMd = {};
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccdMd.read_perm);
    setSecurityMode(&cccdMd.write_perm, halChar->flags);
    cccdMd.vloc = BLE_GATTS_VLOC_STACK;
    // Characteristic metadata
    ble_gatts_char_md_t charMd = {};
    charMd.char_props.notify = 1;
    charMd.p_cccd_md = &cccdMd;
    // Value attribute metadata
    ble_gatts_attr_md_t attrMd = {};
    setSecurityMode(&attrMd.read_perm, halChar->flags);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attrMd.write_perm);
    attrMd.vloc = BLE_GATTS_VLOC_STACK;
    attrMd.rd_auth = 0;
    attrMd.wr_auth = 0;
    attrMd.vlen = 1;
    // Value attribute
    ble_gatts_attr_t attr = {};
    attr.p_uuid = &chr->uuid;
    attr.p_attr_md = &attrMd;
    attr.max_len = BLE_MAX_ATTR_VALUE_PACKET_SIZE;
    const uint32_t ret = sd_ble_gatts_characteristic_add(serviceHandle, &charMd, &attr, &chr->handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    chr->flags = halChar->flags;
    halChar->handle = chr->handles.value_handle;
    return 0;
}

int initRxChar(uint16_t serviceHandle, ble_char* halChar, Char* chr) {
    // Characteristic UUID
    chr->uuid.type = halChar->uuid.type;
    chr->uuid.uuid = halChar->uuid.uuid;
    // Characteristic metadata
    ble_gatts_char_md_t charMd = {};
    charMd.char_props.write = 1;
    charMd.char_props.write_wo_resp = 1;
    // Value attribute metadata
    ble_gatts_attr_md_t attrMd = {};
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attrMd.read_perm);
    setSecurityMode(&attrMd.write_perm, halChar->flags);
    attrMd.vloc = BLE_GATTS_VLOC_STACK;
    attrMd.rd_auth = 0;
    attrMd.wr_auth = 0;
    attrMd.vlen = 1;
    // Value attribute
    ble_gatts_attr_t attr = {};
    attr.p_uuid = &chr->uuid;
    attr.p_attr_md = &attrMd;
    attr.max_len = BLE_MAX_ATTR_VALUE_PACKET_SIZE;
    const uint32_t ret = sd_ble_gatts_characteristic_add(serviceHandle, &charMd, &attr, &chr->handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    chr->flags = halChar->flags;
    halChar->handle = chr->handles.value_handle;
    return 0;
}

int initValChar(uint16_t serviceHandle, ble_char* halChar, Char* chr) {
    if (!halChar->data || halChar->size == 0) {
        LOG(ERROR, "Characteristic value is not specified");
        return BLE_ERROR_INVALID_PARAM;
    }
    // Characteristic UUID
    chr->uuid.type = halChar->uuid.type;
    chr->uuid.uuid = halChar->uuid.uuid;
    // Characteristic metadata
    ble_gatts_char_md_t charMd = {};
    charMd.char_props.read = 1;
    // Value attribute metadata
    ble_gatts_attr_md_t attrMd = {};
    setSecurityMode(&attrMd.read_perm, halChar->flags);
    attrMd.vloc = BLE_GATTS_VLOC_STACK;
    attrMd.rd_auth = 0;
    attrMd.wr_auth = 0;
    attrMd.vlen = 1;
    // Value attribute
    ble_gatts_attr_t attr = {};
    attr.p_uuid = &chr->uuid;
    attr.p_attr_md = &attrMd;
    attr.p_value = (uint8_t*)halChar->data;
    attr.init_len = halChar->size;
    attr.max_len = halChar->size;
    const uint32_t ret = sd_ble_gatts_characteristic_add(serviceHandle, &charMd, &attr, &chr->handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    chr->flags = halChar->flags;
    halChar->handle = chr->handles.value_handle;
    return 0;
}

