particle-iot/device-os/hal/src/nRF52840/ble_hal_legacy.cpp
int initService(ble_service* halService, Service* service) {
    if (halService->char_count > BLE_MAX_CHAR_COUNT) {
        LOG(ERROR, "Maximum number of characteristics exceeded");
        return BLE_ERROR_INVALID_PARAM;
    }
    service->uuid.type = halService->uuid.type;
    service->uuid.uuid = halService->uuid.uuid;
    const uint32_t ret = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &service->uuid, &service->handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    for (size_t i = 0; i < halService->char_count; ++i) {
        ble_char& halChar = halService->chars[i];
        Char& chr = service->chars[i];
        int ret = BLE_ERROR_UNKNOWN;
        switch (halChar.type) {
        case BLE_CHAR_TYPE_TX: {
            ret = initTxChar(service->handle, &halChar, &chr);
            break;
        }
        case BLE_CHAR_TYPE_RX: {
            ret = initRxChar(service->handle, &halChar, &chr);
            break;
        }
        case BLE_CHAR_TYPE_VAL: {
            ret = initValChar(service->handle, &halChar, &chr);
            break;
        }
        default:
            LOG(ERROR, "Invalid characteristic type: %d", (int)halChar.type);
            return BLE_ERROR_INVALID_PARAM;
        }
        if (ret != 0) {
            LOG(ERROR, "Unable to initialize characteristic, type: %d", (int)halChar.type);
            return ret;
        }
    }
    service->charCount = halService->char_count;
    return 0;
}

int initProfile(ble_profile* halProfile) {
    if (halProfile->service_count > BLE_MAX_SERVICE_COUNT) {
        LOG(ERROR, "Maximum number of services exceeded");
        return BLE_ERROR_INVALID_PARAM;
    }
    for (size_t i = 0; i < halProfile->service_count; ++i) {
        ble_service& halService = halProfile->services[i];
        Service& service = g_profile.services[i];
        const int ret = initService(&halService, &service);
        if (ret != 0) {
            LOG(ERROR, "Unable to initialize service");
            return ret;
        }
    }
    g_profile.serviceCount = halProfile->service_count;
    g_profile.flags = halProfile->flags;
    g_profile.callback = halProfile->callback;
    g_profile.userData = halProfile->user_data;
    return 0;
}

int initGatt() {
    // Initialize the GATT module
    ret_code_t ret = nrf_ble_gatt_init(&g_gatt, processGattEvent);
    if (ret != NRF_SUCCESS) {
        return halError(ret);
    }
    // Set data length size
    ret = nrf_ble_gatt_data_length_set(&g_gatt, BLE_CONN_HANDLE_INVALID, DEFAULT_DATA_LENGTH);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "nrf_ble_gatt_data_length_set() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    // Set MTU size
    ret = nrf_ble_gatt_att_mtu_periph_set(&g_gatt, DEFAULT_MTU);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "nrf_ble_gatt_att_mtu_periph_set() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    return 0;
}

int initGap(const char* deviceName) {
    ble_gap_conn_sec_mode_t secMode = {};
    // Require no protection
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);
    // Set device name
    uint32_t ret = sd_ble_gap_device_name_set(&secMode, (const uint8_t*)deviceName, strlen(deviceName));
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_device_name_set() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    // Set PPCP (Peripheral Preferred Connection Parameters)
    ble_gap_conn_params_t connParam = {};
    connParam.min_conn_interval = MIN_CONN_INTERVAL;
    connParam.max_conn_interval = MAX_CONN_INTERVAL;
    connParam.conn_sup_timeout = CONN_SUP_TIMEOUT;
    connParam.slave_latency = SLAVE_LATENCY;
    ret = sd_ble_gap_ppcp_set(&connParam);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    return 0;
}

} // ::
#endif

int ble_init(void* reserved) {
#ifdef BLE_HAL_LEGACY
    if (!nrf_sdh_is_enabled()) {
        LOG(ERROR, "SoftDevice is not enabled");
        return BLE_ERROR_INVALID_STATE;
    }
    // Configure the stack using the SDK's default settings
    uint32_t ramStart = 0; // Start address of the application RAM
    ret_code_t ret = nrf_sdh_ble_default_cfg_set(CONN_CFG_TAG, &ramStart);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "nrf_sdh_ble_default_cfg_set() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    LOG_DEBUG(TRACE, "RAM start: 0x%08x", (unsigned)ramStart);
    // Enable the stack
    ret = nrf_sdh_ble_enable(&ramStart);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "nrf_sdh_ble_enable() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    // Register a handler for BLE events
    NRF_SDH_BLE_OBSERVER(bleObserver, BLE_OBSERVER_PRIO, processBleEvent, nullptr);
#endif

    return 0;
}

int ble_add_base_uuid(const char* uuid, uint8_t* uuid_type, void* reserved) {
#ifdef BLE_HAL_LEGACY
    ble_uuid128_t u = {};
    static_assert(sizeof(u.uuid128) == 16, "");
    memcpy(u.uuid128, uuid, sizeof(u.uuid128));
    const uint32_t ret = sd_ble_uuid_vs_add(&u, uuid_type);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_uuid_vs_add() failed: %u", (unsigned)ret);
        return halError(ret);
    }
#endif

    return 0;
}

int ble_init_profile(ble_profile* profile, void* reserved) {
#ifdef BLE_HAL_LEGACY
    if (profile->version > BLE_API_VERSION) {
        LOG(ERROR, "Unsupported API version");
        return BLE_ERROR_INVALID_PARAM;
    }
    if (!profile->device_name || !profile->callback) {
        LOG(ERROR, "Invalid profile parameters");
        return BLE_ERROR_INVALID_PARAM;
    }
    int ret = initGap(profile->device_name);
    if (ret != 0) {
        LOG(ERROR, "Unable to configure GAP");
        return ret;
    }
    ret = initGatt();
    if (ret != 0) {
        LOG(ERROR, "Unable to initialize GATT");
        return ret;
    }
    ret = initProfile(profile);
    if (ret != 0) {
        LOG(ERROR, "Unable to initialize profile");
        return ret;
    }
    ret = initAdvert(profile->manuf_data);
    if (ret != 0) {
        LOG(ERROR, "Unable to initialize advertising module");
        return ret;
    }
#endif

