particle-iot/device-os/hal/src/nRF52840/ble_hal_legacy.cpp
    return 0;
}

int ble_start_advert(void* reserved) {
#ifdef BLE_HAL_LEGACY
    g_advertEnabled = true;
    if (g_conn.handle == BLE_CONN_HANDLE_INVALID) {
        const uint32_t ret = ble_advertising_start(&g_advert, BLE_ADV_MODE_FAST);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "ble_advertising_start() failed: %u", (unsigned)ret);
            return halError(ret);
        }
    } // else: Advertising will be restarted automatically when the client disconnects
#endif

    return 0;
}

void ble_stop_advert(void* reserved) {
#ifdef BLE_HAL_LEGACY
    g_advertEnabled = false;
    if (g_advert.initialized && g_conn.handle == BLE_CONN_HANDLE_INVALID) {
        const uint32_t ret = sd_ble_gap_adv_stop(g_advert.adv_handle);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        }
    }
#endif
}

int ble_get_char_param(uint16_t conn_handle, uint16_t char_handle, ble_char_param* param, void* reserved) {
#ifdef BLE_HAL_LEGACY
    if (param->version > BLE_API_VERSION) {
        LOG(ERROR, "Unsupported API version");
        return BLE_ERROR_INVALID_PARAM;
    }
    const auto chr = findChar(char_handle);
    if (!chr) {
        LOG(ERROR, "Unknown characteristic");
        return BLE_ERROR_INVALID_PARAM;
    }
    // Check if the client has enabled notifications
    uint8_t buf[2] = {};
    ble_gatts_value_t val = {};
    val.p_value = buf;
    val.len = sizeof(buf);
    val.offset = 0;
    const uint32_t ret = sd_ble_gatts_value_get(conn_handle, chr->handles.cccd_handle, &val);
    if (ret != NRF_SUCCESS) {
        // LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
        return halError(ret);
    }
    param->notif_enabled = ble_srv_is_notification_enabled(val.p_value);
#endif

    return 0;
}

int ble_set_char_value(uint16_t conn_handle, uint16_t char_handle, const char* data, uint16_t size, unsigned flags, void* reserved) {
#ifdef BLE_HAL_LEGACY
    if (flags & BLE_SET_CHAR_VALUE_FLAG_NOTIFY) {
        // Update value of the attribute and send a notification
        uint16_t n = size;
        ble_gatts_hvx_params_t param = {};
        param.handle = char_handle;
        param.p_data = (const uint8_t*)data;
        param.p_len = &n;
        param.type = BLE_GATT_HVX_NOTIFICATION;
        const uint32_t ret = sd_ble_gatts_hvx(conn_handle, &param);
        if (ret == NRF_ERROR_RESOURCES) {
            return BLE_ERROR_BUSY;
        }
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
            return halError(ret);
        }
        return n;
    } else {
        ble_gatts_value_t val = {};
        val.p_value = (uint8_t*)data;
        val.len = size;
        const uint32_t ret = sd_ble_gatts_value_set(conn_handle, char_handle, &val);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
            return halError(ret);
        }
        return val.len;
    }
#endif

    return 0;
}

int ble_get_conn_param(uint16_t conn_handle, ble_conn_param* param, void* reserved) {
#ifdef BLE_HAL_LEGACY
    if (param->version > BLE_API_VERSION) {
        LOG(ERROR, "Unsupported API version");
        return BLE_ERROR_INVALID_PARAM;
    }
    const uint16_t mtu = nrf_ble_gatt_eff_mtu_get(&g_gatt, conn_handle);
    if (mtu < BLE_MIN_ATT_MTU_SIZE) {
        LOG(ERROR, "nrf_ble_gatt_eff_mtu_get() failed");
        return BLE_ERROR_UNKNOWN;
    }
    param->att_mtu_size = mtu;
#endif

    return 0;
}

void ble_disconnect(uint16_t conn_handle, void* reserved) {
#ifdef BLE_HAL_LEGACY
    const uint32_t ret = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        LOG(WARN, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
    }
#endif
}
